src/main/resources/wsdl/request.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Header />
	<SOAP-ENV:Body>
		<ns2:getCountryRequest xmlns:ns2="http://nbrsolutions.com">
			<ns2:name>Spain</ns2:name>
		</ns2:getCountryRequest>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>